[{
        "Timestamp": "2017/07/23 5:05:06 PM EST",
        "Username": "samirbehara@gmail.com",
        "FirstName": "Samir",
        "LastName": "Behara",
        "SocialNetwork": "@samirbehara",
        "Phone": "",
        "Bio": "Samir Behara has a Bachelor Degree in Computer Science and has been part of the IT Industry since he graduated in 2006. He has worked on large-scale enterprise applications involving complex business functions, web integration, and data management in various domains like Insurance, Manufacturing, and Publishing. Samir works as a Senior Developer at EBSCO Industries, Birmingham and builds software solutions using cutting edge Microsoft technologies, primarily C# and SQL Server. \n\nAmidst working in a wide range of technologies - both front end and back end, one thing which has not changed is his love for SQL Server. He is passionate about developing his SQL skills, contributing to the SQL Server community and keeping in pace with the new technologies and advancements. He is the Co-Chapter Lead of the Steel City SQL Server Users Group – which is the Birmingham, AL chapter of PASS. He is the author of www.dotnetvibes.com",
        "Sessions": [{
            "Title": "Making Developers Lives Easier with SQL Server 2016",
            "Description": "Do you want insights into how your data has changed over a period of time?\nAre you using JSON as your data interchange format and want to integrate with SQL Server?\nDo you wish to have more statistical/historical information while troubleshooting a T-SQL performance issue?\nDo you face any problem while troubleshooting a long running query?\nHave you encountered performance issues after server/application upgrades?\n\nIf your answer to any of the above questions is YES, then this session is for YOU.  \nDuring this content rich and demo intensive session, you will understand the rich capabilities of SQL Server 2016 and how the life of a SQL Developer is getting transformed with features like Query Store, Live Query Statistics, Comparing Execution Plans, Built-in JSON Support, Temporal Database and other nice T-SQL enhancements.",
            "Level": "Intermediate",
            "Objective": "During this content rich and demo intensive session, you will understand the rich capabilities of SQL Server 2016 and how the life of a SQL Developer is getting transformed with features like Query Store, Live Query Statistics, Comparing Execution Plans, Built-in JSON Support, Temporal Database and other nice T-SQL enhancements.",
            "Area": "Database"
        }, {
            "Title": "Coding at 100 mph: Tips and Tricks in SSMS 2017",
            "Description": "Be it a T-SQL Developer or DBA, we spend most of our time working in SSMS. In this session, we will learn a number of tips and tricks to increase productivity and efficiency in SSMS IDE. This will be a content rich session with plenty of live demos.\n \nEvery developer wants to be productive and get more things accomplished during their day to day work. Given a choice between working harder and working smarter, you will most likely choose the latter. But the big question is – How do you boost your productivity? How do you reduce your development time? How do you increase your coding speed? Gaining a superlative understanding of the IDE goes a long way in increasing one’s productivity.\n \nSQL Server Management Studio has a number of hidden features which might not have been advertised much, but knowing these features will make your life so much easier.We will explore ways to stop doing manual repetitive tasks, use shortcuts, type less and generate more lines of code in minimal time. At the end of this session, you will learn some useful techniques to take back with you and apply in your day to day work.",
            "Level": "Intermediate",
            "Objective": " In this session, you will learn a number of tips and tricks which will enhance your productivity and efficiency in SSMS IDE. We will explore ways to stop doing manual repetitive tasks, use shortcuts, type less and generate more lines of code in minimal time. At the end of this session, you will learn some useful techniques to take back with you and apply in your day to day work.",
            "Area": "Database"
        }],

        "Comment": ""
    },
    {
        "Timestamp": "2017/06/23 2:44:14 AM EST",
        "Username": "inlee@troy.edu",
        "FirstName": "Ingyu",
        "LastName": "Lee",
        "SocialNetwork": "",
        "Photo": "Lee.jpg",
        "Phone": "",
        "Bio": "Ingyu Lee is an instructor in the Sorrell College of Business at Troy University. He received his Ph.D. from the Department of Computer Science and Engineering at The Pennsylvania State University. After graduated, he is spending his time on teaching programming to Information System major students. His main interest is developing data mining and machine learning algorithms, and applying those algorithms to business applications.",
        "Sessions": [{
            "Title": "Starting Deep Learning with Python",
            "Description": "This talk introduces the concept and usage of deep learning in python computing environments. The audience will learn the basic ideas and applications of  deep learning technologies. Especially, this talk will focus on using Keras on Theano and Tensorflow, and the exercises are designed for software engineers and data scientists. ",
            "Level": "Beginner",
            "Objective": "",
            "Area": "Cloud Development;Data science"
        }],
        "Comment": ""
    },
    {
        "Timestamp": "2017/08/03 1:56:16 PM EST",
        "Username": "ohri.sachin@gmail.com",
        "FirstName": "Sachin",
        "LastName": "Ohri",
        "SocialNetwork": "",
        "Photo": "Ohri.jpg",
        "Phone": "",
        "Bio": "I am a Technology Architect with 13+ years of experience. My expertise include  C#, ASP.NET MVC, Angular, Typescript and Azure. I have been involved in web application development for last 10 years and have been an Architect for last 5 years. Currently I am working on a book for Typescript and Angular scheduled to be released by end of the year.",
        "Sessions": [{
            "Title": "Typescript: Surprisingly Simple, Extraordinarily Powerful",
            "Description": "This session will introduce attendees with Typescript and how it can help write more maintainable, robust and error free code. We will look at main features of Typescript and how Typescript transpiles into JavaScript.",
            "Level": "Beginner",
            "Objective": "Today as we move towards ES6 and ES7, we see that JavaScript community is adapting and accepting the features of traditional programming languages like C# and Java. This helps developers to write more mainatable code and also provides good base for new developers coming into JavaScript from Java or C#.\nTypescript adds more features on top of these new features like types and interfaces which allows us to write object oriented code in JavaScript, even for the browser which do not support ES6. \nLearning Typescript will allow developers to create large applications with more confidence.",
            "Area": "Web Development"
        }],
        "Comment": "I have given sessions in my organization but do not have experience outside of that."
    },
    {
        "Timestamp": "2017/08/03 4:11:51 PM EST",
        "Username": "bryans@kentico.com",
        "FirstName": "Bryan",
        "LastName": "Soltis",
        "SocialNetwork": "@bryan_soltis",
        "Phone": "",
        "Bio": "Bryan Soltis is the Technical Evangelist at Kentico and an avid .NET developer. With over 18 years of web development experience, Bryan has completed projects for Microsoft, IMG, HP, and other Fortune 500 companies. A former Azure VTSP, Bryan has developed numerous applications with Microsoft’s cloud and Kentico, including custom software development, integrated solutions, and globally-available enterprise applications. Bryan enjoys working with the development community and educating developers on best practices, new technologies, and utilizing .NET, the cloud, and Kentico to their fullest potentials. And he really likes beer.",
        "Sessions": [{
            "Title": "Microservice-Powere­d Applications - It worked for Voltron, it can work for you!",
            "Description": "Everyone knows that when you assemble a bunch of underdogs together, they become an unstoppable force. Whether it’s Voltron battling a Robeast, or a bunch of ants taking on a biker flying biker gang, combining several resources into one is a great way to add strength and capabilities to a team. In this session, Kentico Technical Evangelist Bryan Soltis will show you how to apply these same principles to building web applications using microservices for content hosting and delivery, search, and automation, all hosted in Azure.",
            "Level": "Intermediate;Advanced",
            "Objective": "",
            "Area": "Web Development;Cloud Development"
        }],
        "Comment": ""
    },
    {
        "Timestamp": "2017/08/03 4:11:51 PM EST",
        "Username": "keidrickp@gmail.com",
        "FirstName": "Keidrick",
        "LastName": "Pettaway",
        "SocialNetwork": "@kpett",
        "Phone": "",
        "Bio": "Keidrick is Practiced Technologist with over 10 years of experience in Private Sector, Higher Education and DOD Industry space. He currently works for a Revenue Cycle Management provider working primarily on the Microsoft Tech Stack.",
        "Sessions": [{
            "Title": "",
            "Description": "",
            "Level": "Intermediate;Advanced",
            "Objective": "",
            "Area": "DataBase"
        }],
        "Comment": ""
    },
    {
        "Timestamp": "2017/08/03 4:11:51 PM EST",
        "Username": "xzhang@zhresearches.com",
        "FirstName": "Xiangdong",
        "LastName": "Zhang",
        "SocialNetwork": "@zhangxd6",
        "Phone": "",
        "Bio": "He is most focused on Web technology and Microsoft stack as his backend choice.He is excited about new technologies, particularly in the cloud frontier and container, for instance Microsoft Azure and any frontend development. More recently, he grow his interest by tinkering with Arduino, 3D printing, and exploring IoT.  ",
        "Sessions": [{
                "Title": "Get started with azure service fabric",
                "Description": "We will explore the offer Microsoft provided to realize microservice architecture, Azure Service Fabric, by starting with why the industry is talking about it, what it is and what the pros and cons are. Then we will dive directly into Azure Service Fabric to show three different programing modes it provides with live coding  in Visual Studio as much as possible",
                "Level": "Intermediate;Advanced",
                "Objective": "Get familiar with azure service fabric programing models ",
                "Area": "Cloud Development"
            },
            {
                "Title": "Docker 101",
                "Description": "This will be introduction of docker, a virtualization technology. In the session, we will explore what is docker, what problems it is trying to solve and how can get it started. ",
                "Level": "Beginner",
                "Objective": "Introduce the docker ",
                "Area": "Cloud Development;DevOps"
            }
        ],
        "Comment": ""
    },
    {
        "Timestamp": "2017/08/03 4:11:51 PM EST",
        "Username": "kellynicole.w@gmail.com",
        "FirstName": "Kelly",
        "LastName": "Wong",
        "SocialNetwork": "",
        "Phone": "",
        "Photo": "kelly.jpg",
        "Bio": "Kelly is a Software Quality Assurance professional who has over 18 years experience at various companies in the private sector.  She is involved with automated testing of web applications using Selenium on the Microsoft stack.  She is currently working at a Revenue Cycle Management provider as a QA Engineer.",
        "Sessions": [{
            "Title": "Automated Testing",
            "Description": "Introduction into getting started with Automated Testing",
            "Level": "Beginner;Intermediate",
            "Objective": "Hand coding an automated test using Selenium in C#.",
            "Area": "Other"
        }],
        "Comment": ""
    },
    {
        "Timestamp": "2017/08/03 4:11:51 PM EST",
        "Username": "kevin.garner@ssigroup.com",
        "FirstName": "Kevin",
        "LastName": "Garner",
        "SocialNetwork": "",
        "Phone": "",
        "Photo": "kevin.jpg",
        "Bio": "Kevin Garner is a software engineer with 7 years of experience in .NET, C#, SQL Server, and web development via JavaScript (and now TypeScript!). Kevin enjoys building software, composing/producing/playing music, developing video games of hobbyist quality, learning Japanese, and writing fiction.",
        "Sessions": [{
            "Title": "SOLID Programming: Applying the Principle of Single Responsibility            ",
            "Description": "In this session, attendees can learn to write code that is easy to test, simple to expand, and adaptable to change. At the core of this talk is the Single Responsibility Principle (SRP), which is part of SOLID Programming Principles. The speaker will demonstrate how to refactor legacy code and apply SRP. SOLID Programming is a set of five essential principles which can lead to robust, long - lasting code.Robert C.Martin,software engineer and celebrated author of some of the most essential programming books today, coined the acronym SOLID to represent a collection of what he considered the most essential principles for any programmer.The first component of SOLID is the Single Responsibility Principle(SRP),and in the world of enterprise software engineering,not applying SRP can quickly lead to code with the power of the gods and the inflexibility of a fluorescent light bulb.However, by learning and applying SRP, armed with the power of interfaces and the safety net of unit testing,a programmer can transform almost any code base from untouchable 'legacy code' into living, adaptive code that creates value and can stand the test of time.",
            "Level": "Intermediate",
            "Objective": "Learn what the Single Responsibility Principle (SRP) is and how to apply it to existing code",
            "Area": "Web Development; Database;Other"
        }],
        "Comment": ""
    },
    {
        "Timestamp": "2017/08/03 4:11:51 PM EST",
        "Username": "kevin.grohoske@sparkhound.com",
        "FirstName": "Kevin",
        "LastName": "Grohoske",
        "SocialNetwork": "",
        "Phone": "",
        "Photo": "krg.jpg",
        "Bio": "Kevin Grohoske is an experienced IT Leader who got his start at a young age writing software on a Timex Sinclair 1000. He has since gone on to work for 20+ years with Fortune 100 companies, Small/Medium Businesses, and lead multiple teams achieving both the “Inc. 5000” and “Best Places to Work” recognitions. He is recognizing for his “culture first” leadership style and being on the forefront of trends in software development.Kevin’ s technical enterprise expertise is demonstrated by his past work on building e - commerce platforms, content management platforms, Microsoft - centric development technologies, as well as open source platforms.He has contributed on numerous projects as an executive leader, enterprise architect,solution architect,project manager,as well as hands - on software development.He also is frequent speaker at local and region technical events,led user’ s groups,and organized major technical conferences.",
        "Sessions": [{
            "Title": "Leveraging Microsoft’s Cognitive Services for Building the Next Generation of Software",
            "Description": "",
            "Level": "Intermediate",
            "Objective": "",
            "Area": "Cloud Development"
        }],
        "Comment": ""
    },
    {
        "Timestamp": "2017/08/03 4:11:51 PM EST",
        "Username": "ozkary@yahoo.com        ",
        "FirstName": "Oscar",
        "LastName": "Garcia",
        "SocialNetwork": "ozkary",
        "Phone": "",
        "Photo": "",
        "Bio": "Oscar Garcia is a Software Solutions Architect who resides in Sunny South Florida. He is a Microsoft MVP and certified solutions developer with many years of experience building solutions using .Net framework and multiple open source frameworks. Currently, he specializes in building cloud solutions using technologies like Azure, ASP.NET, NodeJS, AngularJS, and other JavaScript frameworks. He enjoys sharing his technical experiences by maintaining a blog and doing presentations .You can follow Oscar on Twitter via @ozkary or visiting his blog at ozkary.com ",
        "Sessions": [{
            "Title": "Securing Web apps with Azure AD ",
            "Description": "",
            "Level": "Beginner;Intermediate",
            "Objective": "When building a cloud app,one of the most common cross cutting concerns is the authentication of users.For some solutions,the security implementation is handled by the application itself.In this article,we explore the use of Azure Active Directory(AAD) to provide the security servicesfor our web or mobile apps. The application we are building is a Node.js backend API with an AngularJS front end.We explore the following areas:•Create an AngularJS App and use Git to deploy to Azure• Add Azure Active Directory(AD) service authentication to protect our app• Discuss the limitation using simple AD authentication when enabling anonymous access to some routes.•Enhance our security by taking direct control of the Azure AD APIs in our code to consume the Jason Web Token(JWT) from the Azure Identity provider ",
            "Area": "Web Development;Cloud Development;DevOps"
        }],
        "Comment": ""
    },
    {
        "Timestamp": "2017/08/17 8:52:51 PM EST",
        "Username": "atkinbp@gmail.com",
        "FirstName": "Brandon",
        "LastName": "Atkins",
        "SocialNetwork": "",
        "Phone": "",
        "Photo": "atkins.jpg",
        "Bio": "Brandon Atkins is a full stack software developer who enjoys building interactive web applications and has experience in building single page applications.",
        "Sessions": [{
            "Title": "Building a Web App with the Angular CLI",
            "Description": "Discussing the types of problems Angular solves for developement teams and build a demo site from scratch using the Angular CLI.",
            "Level": "Intermediate;",
            "Objective": "Build a small single page application.",
            "Area": "Web Development;"
        }],
        "Comment": ""
    }
]